src/cf/DataProcessors/ПримерРаботыВалидатора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПримерРаботыВалидатора</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>JsonДляПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаOpenApi</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/ПримерРаботыВалидатора/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.СхемаOpenApi = Обработки.ПримерРаботыВалидатора.ПолучитьМакет("OpenApi").ПолучитьТекст();
	ЗагрузитьJsonДляПроверки();
	
КонецПроцедуры

&НаКлиенте
Процедура Валидировать(Команда)
	ВалидироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалидироватьНаСервере()
	МодельДанных = ВалидаторПакетовПовтИсп.JsonВОбъект(Объект.JsonДляПроверки);
	МассивОшибок = ВалидаторПакетов.Валидировать(МодельДанных, "complex_object", Объект.СхемаOpenApi);
	
	Если МассивОшибок.количество() = 0 Тогда
		Сообщить("Валидация прошла успешно!");
		Возврат;
	КонецЕсли;
	
	Для Каждого Ошибка Из МассивОшибок Цикл
		Сообщить(Ошибка,СтатусСообщения.Внимание);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьJsonДляПроверки()
Если Переключатель Тогда
	ИмяМакета = "НевалидныйJson";
Иначе
	ИмяМакета = "Валидныйjson";
КонецЕсли;
Объект.JsonДляПроверки = Обработки.ПримерРаботыВалидатора.ПолучитьМакет(ИмяМакета).ПолучитьТекст();
КонецПроцедуры

&НаКлиенте
Процедура ПереключательПриИзменении(Элемент)
	ЗагрузитьJsonДляПроверки();
КонецПроцедуры
